app/controllers/service_controller.rb

SELECT `services`.* FROM `services`
---
	def index
		@service = Service.all.delete_if{|service|service.name.blank?}