app/controllers/vote_controller.rb

SELECT `vote_types`.* FROM `vote_types`
---
	def question

		@voteType = VoteType.all

SELECT `issues`.* FROM `issues`
---
	def issue_description

		@issue = Issue.all

SELECT `vote_types`.* FROM `vote_types` WHERE `vote_types`.`name` = 'SATISFIED' LIMIT 1
SELECT `services`.* FROM `services` WHERE `services`.`name` = 'Martenity' LIMIT 1
INSERT INTO `votes` (`vote_type_id`, `client_id`, `service_id`, `created_at`, `updated_at`) VALUES (19, 5, 2, '2013-10-24 08:51:05', '2013-10-24 08:51:05')
SELECT `votes`.* FROM `votes` WHERE `votes`.`vote_id` = 1 LIMIT 1
---
    def save_vote

		#raise params.to_yaml
		vote = Vote.new

		vote.client_id =  6  #the value  is a testing static value which should be replaced by a hashed string from client


        vote.vote_type_id =  VoteType.find_by_name(params[:vote_type]).id
		vote.service_id = 	 Service.find_by_name(params[:service_type]).id


	    if vote.save
		a= Vote.find(1,7)  #just trying to chech is the values are entering ther database